cubeInlet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet-velocity
    {
        type            patch;
        nFaces          1600;
        startFace       1395540;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9560;
        startFace       1397140;
    }
    pressure-outlet
    {
        type            patch;
        nFaces          1600;
        startFace       1406700;
    }
    cylinder
    {
        type            wall;
        inGroups        2(cylinders wall);
        nFaces          58880;
        startFace       1408300;
    }
)

// ************************************************************************* //
